{
  "navbar": {
    "glavn": "Glóvna",
    "directory": "Katalogi",
    "project": "Nasz projekt",
    "dashboard": "Dashboard",
    "cabinet": "Cabinet",
    "kontact": "Kontakty",
    "login":"Wejście",
    "logout": "Wyjście"
  },
  "login": {
    "header": "Zaloguj się do konta klienta",
    "login": "Wejście",
    "logout": "Wyjście",
    "errorMessageEmail": "Wprowadź poprawny email",
    "errorMessagePassword": "wprowadź poprawne hasło",
    "placeholderEmail": "Wprowadź swój email",
    "placeholderPassword": "Hasło"
  },
  "home": {
    "deviz":{
      "text1": "Oferuję rozwiązanie twoich problemów",
      "text2": "Zagłębiam się w problem, proponuję optymalne rozwiązanie, jak najszybciej wdrażam projekt"
    },  
      "modul1":{
        "text1":"Główny",
        "text2":"kierunek rozwoju",
        "cards":{
          "card1": {
            "header": "Tworzenie baz danych",
            "text": "Jednym z głównych kierunków naszej pracy jest rozwój baz danych i systemów zarządzania bazami danych (DBMS). Pracujemy z bazami danych o różnych architekturach (MySQL, MSSQL, Interbase, Firebird, Postgresql). Interfejs oprogramowania jest opracowywany na życzenie klienta w postaci wygodniejszego dla niego oprogramowania, zarówno dla interfejsu WWW, jak i interfejsu API systemu operacyjnego."
          },
          "card2": {
            "header": "Konfiguracja serwera",
            "text": "Instalacja pod klucz i konfiguracja stacji serwerowych z systemami Linux, Windows, zgodnie z zadaniem klienta. Konfigurowanie serwerów z zainstalowanymi systemami wirtualizacji Proxmox lub VMWare"
      
          },
          "card3": {
            "header": "Protokół API Development",
            "text": "Opracowanie i wykorzystanie wniosków REST w systemach płatności, w systemach gromadzenia informacji elektronicznych urządzeń pomiarowych, a także w organizacji wysyłki"
          },
          "card4": {
            "header":"Web Programowanie",
            "text": "W dzisiejszym świecie nie da się już obejść bez aplikacji internetowych, zajmuję się tworzeniem aplikacji internetowych w technologii FullStack, aby zaprezentować produkty i usługi szerokiemu gronu odbiorców, tworząc atrakcyjne i funkcjonalne strony internetowe."
          }
        }
      },
      "modul2":{
        "text1":"Umiejętności",
        "text2":"Języki programowania i środowiska programistyczne",
        "skils":{
          "skil0":{
            "title":"Delphi",
            "subheader":"Pascal"
          },
          "skil1":{
            "title":"Node JS",
            "subheader":"JavaScript/REST Api"
          },
          "skil2":{
            "title":"React JS",
            "subheader":"JavaScript"
          },
          "skil3":{
            "title":"SQL",
            "subheader":"MSQL/MySQl/Firebird ..."
          },
          "skil4":{
            "title":"HTML/CSS",
            "subheader":" "
          },
          "skil5":{
            "title":"1C",
            "subheader":" "
          },
          "skil6":{
            "title":"VMWare/Proxmox",
            "subheader":"Virtualization"
          },
          "skil7":{
            "title":"Arduino",
            "subheader":"Atmel"
          }
        }
      }      
   },

   "project": {

    "row0":{
      "title": "Strony internetowe",
      "text": "Tworzymy strony od podstaw, korzystamy z nowych technologii i frameworków JavaScript, co pozwala nam pisać jasne i niepowtarzalne strony internetowe",
      "colapseTitle": "Przykłady moich stron",
      "colapseText" : {
        "row1": "Ыекщтф WEBNIT.PL została stworzona w React JS, Bootstrap, z wykorzystaniem animacji CSS",
        "row2": "Strona BROGAN.PL została stworzona w React JS, Bootstrap, c z wykorzystaniem animacji CSS",
        "row3": "Strona Server.itservis.od.ua została opracowana jako testowy panel Dashboard, z wykorzystaniem technologii ReactJS, Redux, Material-UI, REST API, Firebase" 
      }
     },
    "row1": {
      "title": "Usługa płatności",
      "text": "Usługa płatnicza ma na celu przyjmowanie płatności od ludności na rzecz usług użyteczności publicznej, działa na podstawie żądań REST",
      "documents":"Documentation",
      "colapseTitle":"Ogólny opis",
      "colapseText": {
        "row1":"Usługa wymiany została stworzona z myślą o wygodzie jednoczesnego dokonywania dużej liczby płatności, a także dla wygody wdrażania oprogramowania klienckiego poprzez przeniesienie części logiki klienta na serwer.",
        "row2": "Wszystkie polecenia są przesyłane za pośrednictwem protokołu https",
        "row3": "Używane typy żądań:",
        "row4": "Dane żądania są przesyłane w kodowaniu UTF-8.",
        "item1": " - GET",
        "item2": " - POST",
        "item3": " - DELETE"

      }
    },
    "row2": {
      "title": "System płatności bankowych",
      "text": "Oprogramowanie do realizacji możliwości opłacania składek w oddziałach bankowych, terminale płatnicze. Umożliwia pracę na bardzo słabych kanałach komunikacyjnych oraz zapewnia możliwość dokonywania płatności online bezpośrednio od płatnika do usługodawcy."
    },
    "row3": {
      "title": "Modem do przesyłania informacji",
      "text": "Projektowanie własnego układu elektronicznego, pełen zakres od produkcji urządzenia elektronicznego po uruchomienie, podłączenie połączenia modemowego z istniejącym systemem dyspozytorskim",
      "colapseTitle":"Ogólny opis",
      "colapseText": {
        "row1": "Urządzenie do transmisji danych (UP) jest przeznaczone do pobierania informacji z mierników ciepła i przesyłania ich do centralnej bazy danych w celu dalszego przetwarzania i wizualizacji danych.",
        "row2": "Korpus urządzenia wykonany jest z tworzywa sztucznego i jest specjalnie skonfigurowany do montażu w piwnicach. Obudowa posiada uszczelniony wyprowadzenie anteny oraz zaciski do zasilania.",
        "row3": "Urządzenie wyposażone jest w akumulator, który pozwala na autonomiczną pracę przez 360 godzin po odłączeniu zewnętrznego zasilania. UP wyposażony jest w programowany indywidualnie dla klienta mikroprocesor wskazujący numer seryjny ciepłomierza."
      }

    },
    "row4": {
      "documents":"Dokumentacja (rosyjski)",
      "title": "Scentralizowany system przetwarzania informacji",
      "text": "System umożliwia dostęp do bazy danych w tym samym czasie dużej liczbie użytkowników. Każdy użytkownik systemu ma swoją nazwę i hasło z pewnymi przywilejami dostępu do danych. W zwykłym przypadku pracownik przedsiębiorstwa może uzyskać dostęp do określonej części danych systemowych, wykonywać funkcje charakterystyczne dla swoich obowiązków i otrzymywać niezbędne raporty. Wielopoziomowy system do sprawdzania uprawnień użytkowników pozwala całkowicie zabezpieczyć system przed nieautoryzowanym dostępem.",
      "documents":"Dokumentacja (rosyjski)",
      "colapseTitle": "Centralized system of information processing - CISP",
      "colapseText":{
        "row1": "Rachunkowość zasobów mieszkaniowych - podsystem ten zapewnia rozliczanie charakterystyk budynków mieszkalnych, innych obiektów i otoczenia, historię bieżących i kapitalnych remontów budynków i sieci inżynieryjnych.",
        "row2": "Księgowość abonentów - podsystem ten zapewnia bezpośrednie wprowadzanie i przechowywanie wszystkich znaków i atrybutów abonentów, kontrolę poprawności wprowadzania danych, audyt wprowadzanych zmian oraz tworzenie formularzy raportowych. Zapewnia również wygodny interfejs do wyświetlania i wyszukiwania niezbędnych informacji o populacji.",
        "row3": "Uwzględnianie poszczególnych urządzeń pomiarowych i ich odczytów. Podsystem ten zapewnia rozliczanie urządzeń (ich charakterystyki, miejsca instalacji, numery inwentarzowe, daty weryfikacji itp.). Zapewnia również ręczne wprowadzanie i automatyczne ładowanie informacji z banków i miejskich organizacji użyteczności publicznej zgodnie z odczytami liczników. System zapewnia wygodny interfejs do wyświetlania odczytów w kontekście abonentów z automatycznym wskazaniem błędnie wprowadzonych danych.",
        "row4": "I wiele więcej...",
        "row5": ""
      }

    }

  },
  "contact": {
    "block1":{
      "header":"Write to us",
      "text":"Don't like using contact forms? Please contact us by email, we will respond within one business day."
    },
    "block2":{
      "header":"Gdzie zacząć?",
      "text":"Opowiedz nam o swoim projekcie w dowolnej dogodnej dla Ciebie formie, czy to jasno sformułowane wymagania, czy tylko pomysł. Dobierzemy specjalistów do Twoich potrzeb, uwzględniając specyfikę branży, sposób realizacji technologicznej oraz charakter świadczonej usługi."
    },
    "block3":{
      "header":"Конфиденциальность",
      "text":"Мы заботимся о конфиденциальности ваших данных, не допуская их несанкционированной передачи третьим лицам. Многоуровневая система безопасности Itransition позволяет избежать потери, порчи либо утечки любой важной информации, предоставленной клиентами"
    },
    "block4":{
      "header":"Dzień dobry",
      "text1":"Nazywam się Sergiy, jestem Programista z dużym doświadczeniem w zakresie infrastruktury IT, świadczę szereg usług z zakresu tworzenia profesjonalnego oprogramowania, integracji aplikacji, doradztwa informatycznego, testowania, utrzymania oprogramowania i wsparcia.",
      "text2":"Klienci otrzymują do swojej dyspozycji profesjonalny z systemów myślenia i twórczego podejścia, bogate doświadczenie w opracowywaniu i realizacji projektów korporacyjnych, jak i małych aplikacji w różnych językach programowania (JavaScript, Java, Delphi)."
    }
  },
  "kontact": {
    "title": "Nasze kontakty",
    "city": "m. Krakow",
    "phone": "+48 791 329 376",
    "viber": "+48 791 329 376",
    "telegram":"+38(097)599-65-60",
    "skype": "vladimirov_sk",
    "email":"sergey@itservis.od.ua"
  }
}
