{
  "navbar": {
    "glavn": "Главная",
    "directory": "Справочники",
    "project": "Проекты",
    "cabinet": "Кабинет",
    "dashboard": "Управление",
    "kontact": "Контакты",
    "login":"Вход",
    "logout": "Выход"
  },
  "login": {
    "header": "Вход в кабинет клиента",
    "login": "Войти",
    "logout": "Отмена",
    "errorMessageEmail": "введите корректный email",
    "errorMessagePassword": "введите корректный пароль",
    "placeholderEmail": "Введите Ваш email",
    "placeholderPassword": "Пароль"
  },
  "home": {
    "deviz":{
        "text1": "Предлагаю решение Ваших задач",
        "text2": "Вникаю в задачу, предлагаю оптимальное решение, реализую проект в кратчайшие сроки"
    },
    "modul1":{
      "text1":"Основное",
      "text2":"направление разработок",
      "cards":{
        "card1": {
          "header": "Разработка баз данных",
          "text": "Разработка современного программного обеспечения, подразумевает создание БД, которые решат вопросы поиска, классификации и учета полезных сведений, делая рабочий процесс автоматизированным. Без этого ни одно ПО и веб-система не смогут исправно и оперативно функционировать."
        },
        "card2": {
          "header":"Настройка Серверов",
          "text": "Установка и настройка «под ключ» серверных станций с операционными системами Linux, Windows согласно задания заказчика. Настройка серверов с установленными системами виртуализации Proxmox или VMWare"
        },
        "card3": {
          "header":"Разработка API протоколов",
          "text": "Разработка и использование REST запросов, основанных на микросервисах, или организованных в один мощный механизм с API"
        },
        "card4": {
          "header":"Web Программирование",
          "text": "В современном мире уже не возможно обойтись без Web приложений Я занимаюсь FullStack разработкой Web приложений, чтобы представлять Ваши продукты и сервисы широкой аудитории, создавая привлекательные и функциональные веб-сайты. "
        }
      }
    },
    "modul2":{
      "text1":"Знания",
      "text2":"Языки программирования и среды разработок",
      "skils":{
          "skil0":{
            "title":"Delphi",
            "subheader":"Pascal"
          },
          "skil1":{
            "title":"Node JS",
            "subheader":"JavaScript/REST Api"
          },
          "skil2":{
            "title":"React JS",
            "subheader":"JavaScript"
          },
          "skil3":{
            "title":"SQL",
            "subheader":"MSQL/MySQl/Firebird ..."
          },
          "skil4":{
            "title":"HTML/CSS",
            "subheader":" "
          },
          "skil5":{
            "title":"1C",
            "subheader":" "
          },
          "skil6":{
            "title":"VMWare/Proxmox",
            "subheader":"Virtualization"
          },
          "skil7":{
            "title":"Arduino",
            "subheader":"Atmel"
          }
        
      } 
    }
  },
  "project": {
    "link": "Подробнее",
    "category":{
      "title":"Категории",

      "list": {
          "row1": {
            "title": "Программирование"
          },
          "row2": {
            "title": "Электронника"
          }
        }
      },

    "vidjet": {
      "title": "В работе",
      "text": "В разработке электронный прибор по приему информации"
    },

    "row0":{
      "title": "Website",
      "text": "Разработка веб сайтов с нуля, используем новые технологии и фреймфорки JavaScript что позволяет писать яркие и уникальные сайты",
      "colapseTitle": "Примеры моих сайтов",
      "colapseText" : {
        "row1": "WEBNIT.PL, сайт разрабатывался на ReactJS, Botstrap, c использование  анимации CSS",
        "row2": "BROGAN.PL  сайт разрабатывался на ReactJS, Botstrap, c использование  анимации CSS",
        "row3": "Server.itservis.od.ua сайт разрабатывался как тестовая Dashboard panel, c использование технологий ReactJS, Redux, Material-UI, REST API, Firebase" 
      }
     },

    "row1": {
      "title": "Платежный сервис",
      "text": "Платежный сервис преназначен для приема платежей от населения в пользу коммунальных предприятий, работает на основе REST запросов",
      "documents":"Документация",
      "colapseTitle":"Общее описание",
      "colapseText": {
          "row1":"Сервис обмена создан для удобства одновременного проведения большого количества платежей, а также, для удобства реализации клиентского программного обеспечения за счет переноса части клиентской логики на сервер.",
          "row2": "Все команды передаются по https протоколу",
          "row3": "Используемые типы запросов:",
          "row4": "Данные запросов передаются в кодировке UTF-8.",
          "item1": " - GET",
          "item2": " - POST",
          "item3": " - DELETE"

      }
    },
    "row2": {
      "title": "Банковская платежная система",
      "text": "Программное обеспечение для реализации возможности према платежей в отделениях банка, платежных терминалах. Позволяет работать на очень слабых каналах связи, и обеспечивает возможность проведения платежей online непосредственно от платильщика к поставщику услуг."
    },
    "row3": {
      "title": "Модем передачи информации",
      "text": "Пректирование собственной электронной схемы, полный комплекс от изготовления электронного прибора до ввода в эксплуатацию, подключение модемной связи к действующей сисеме диспетчиризации",
      "colapseTitle":"Общее описание",
      "colapseText": {
        "row1": "Устройство передачи данных (УП) предназначенное для съема информации с приборов учета тепла и передачи их в центральную базу данных для дальнейшей обработки, и визуализации данных.",
        "row2": "Корпус устройства выполнен из пластика и сконфигурирован специально для установки в подвальных помещениях. На корпусе предусмотрен герметичный вывод для антенны и клеммы для подключения питания.",
        "row3": "Прибор снабжен аккумулятором который позволяет ему продолжать автономную работу в течении 360 часов после отключения внешнего питания. УП снабжено микропроцессором который программируется индивидуально для заказчика с указанием серийного номера прибора учета тепла."
      }
    },
    "row4": {
      "title": "Система централизованной обработки информации",
      "text": "Система дает возможность доступа к базе данных одновременно большого количества пользователей. Каждый пользователь системы имеет собственное имя и пароль с определенными привилегиями доступа к данным. В обычном случае сотрудник предприятия может получить доступ к указанной части данных системы, исполнять характерные его обязанностям функции и получать необходимые отчеты. Многоуровневая система проверки полномочий пользователя позволяет полностью защитить систему от несанкционированного доступа.",
      "colapseTitle": "Centralized system of information processing - CISP",
      "colapseText":{
        "row1": "Учёт жилого фонда - эта подсистема обеспечивает учёт характеристик жилых домов, других объектов и прилегающей территории, историю проведённых текущих и капитальных ремонтов зданий и инженерных сетей.",
        "row2": "Учет абонентов - эта подсистема обеспечивает непосредственно ввод и хранение всех признаков и атрибутов абонентов, контроль корректности ввода данных, аудит внесенных изменений и формирование отчетных форм. А также обеспечивает удобный интерфейс для отображения и поиска необходимой информации по населению.",
        "row3": "Учёт индивидуальных приборов учёта и их показаний. Эта подсистема обеспечивает учёт приборов (их характеристики, места установок, инвентарные номера, даты поверок и т.д.). Также обеспечивает ручной ввод и автоматическую загрузку информации от банков и городских организаций по обслуживанию населения по показаниям приборов учета. Система предоставляет удобный интерфейс для отображения показаний в разрезе абонентов с автоматической индикацией ошибочно введенных данных.",
        "row4": "И многое другое....",
        "row5": ""
      }
    }

  },
  "contact": {
    "block1":{
      "header":"Напишите мне",
      "text":"Свяжитесь со мной по email, я отвечу в течение одного рабочего дня."
    },
    "block2":{
      "header":"С чего начать?",
      "text":"Расскажите мне про свой проект в любой удобной для Вас форме, будь то четко сформулированные требования или просто идея. Я подберу несколько решений Вашей задачи и мы вместе определим оптимальное"
    },
    "block3":{
      "header":"Конфиденциальность",
      "text":"Ваши данные в надежных руках, любая информация предоставленная клиентом публикуется только с разрешения клиента. Все материалы переданные клиентом для разработки хранятся в безопасности и будут возвращены при завершении работы с проектом."
    },
    "block4":{
      "header":"Здравствуйте",
      "text1":"Меня зовут Сергей, я являюсь Частным предпринимателем, с богатым опытом работы в ИТ инфраструктуре, Предоставляю комплекс услуг в сфере профессиональной разработки программного обеспечения, интеграции приложений, консультационных услуг в сфере IT, тестирования, сопровождения и поддержки ПО.",
      "text2":"Клиенты получают в свое распоряжение профессионала с системным мышлением и творческим подходом, большим опытом разработки и внедрения корпоративных проектов, а также небольших приложений на различных языках программирования (JavaScript, Java, Delphi)."
    }
  },

  "kontact": {
    "title": "Наши контакты",
    "city": "г. Одесса",
    "viber": "380975996560",
    "telegram":"380975996560",
    "skype": "vladimirov_sk",
    "email":"sergey@it-vladimirov.com"
  },
  "cabinet":{
    "brand":"Личный кабинет",
    "ls":"Лицевой счет",
    "addls":"Добавить лицевой счет",
    "tab1":{
      "title":"Начисления"
    },
    "tab2":{
      "title":"История"
    },
    "tab3":{
      "title":"Оплаты"
    }



  }

}
